load-test/results/fastify/3k-vus-pg
yarn run v1.22.4
$ VUS=3000 yarn load-test
$ k6 run --summary-trend-stats="avg,min,max,p(90),p(95),p(99)" load-test-get.js

          /\      |‾‾|  /‾‾/  /‾/   
     /\  /  \     |  |_/  /  / /    
    /  \/    \    |      |  /  ‾‾\  
   /          \   |  |‾\  \ | (_) | 
  / __________ \  |__|  \__\ \___/ .io

  execution: local
     output: -
     script: load-test-get.js

    duration: -, iterations: -
         vus: 1, max: 3000

    init [----------------------------------------------------------] starting
    ✗ is status 200
     ↳  46% — ✓ 40675 / ✗ 47523

    checks.....................: 46.17% ✓ 40675  ✗ 47419 
    data_received..............: 19 MB  312 kB/s
    data_sent..................: 6.9 MB 115 kB/s
    http_req_blocked...........: avg=63.22µs  min=4.1µs max=15.33ms p(90)=11.9µs p(95)=21.4µs p(99)=1.66ms 
    http_req_connecting........: avg=53.43µs  min=0s    max=15.23ms p(90)=0s     p(95)=0s     p(99)=1.59ms 
  ✗ http_req_duration..........: avg=954.37ms min=0s    max=2.4s    p(90)=1.24s  p(95)=1.28s  p(99)=1.51s  
    http_req_receiving.........: avg=49.01µs  min=0s    max=39.77ms p(90)=64.9µs p(95)=77µs   p(99)=144.1µs
    http_req_sending...........: avg=19.07µs  min=0s    max=10.57ms p(90)=22.8µs p(95)=34.9µs p(99)=93.7µs 
    http_req_tls_handshaking...: avg=0s       min=0s    max=0s      p(90)=0s     p(95)=0s     p(99)=0s     
    http_req_waiting...........: avg=954.3ms  min=0s    max=2.4s    p(90)=1.24s  p(95)=1.28s  p(99)=1.51s  
    http_reqs..................: 88095  1468.246356/s
    iteration_duration.........: avg=1.95s    min=1s    max=3.41s   p(90)=2.24s  p(95)=2.28s  p(99)=2.52s  
    iterations.................: 86621  1443.679751/s
    vus........................: 3000   min=590  max=3000
    vus_max....................: 3000   min=3000 max=3000

info Visit https://yarnpkg.com/en/docs/cli/run for documentation about this command.
info Visit https://yarnpkg.com/en/docs/cli/run for documentation about this command.