load-test/results/fastify/3k-vus-pg

          /\      |‾‾|  /‾‾/  /‾/   
     /\  /  \     |  |_/  /  / /    
    /  \/    \    |      |  /  ‾‾\  
   /          \   |  |‾\  \ | (_) | 
  / __________ \  |__|  \__\ \___/ .io

  execution: local
     output: -
     script: ./scripts/load-test-get.js

    duration: -, iterations: -
         vus: 1, max: 3000

    init [----------------------------------------------------------] starting
    ✓ is status 200

    checks.....................: 100.00% ✓ 165546 ✗ 0     
    data_received..............: 24 MB   401 kB/s
    data_sent..................: 13 MB   217 kB/s
    http_req_blocked...........: avg=32.9µs  min=4.4µs   max=12.58ms  p(90)=12.8µs   p(95)=19.4µs   p(99)=681.6µs 
    http_req_connecting........: avg=23.21µs min=0s      max=12.53ms  p(90)=0s       p(95)=0s       p(99)=620.33µs
  ✗ http_req_duration..........: avg=49.35ms min=1.06ms  max=350.73ms p(90)=144.9ms  p(95)=180.18ms p(99)=259.92ms
    http_req_receiving.........: avg=54.54µs min=19.1µs  max=7.78ms   p(90)=72.5µs   p(95)=85.9µs   p(99)=173.55µs
    http_req_sending...........: avg=19.76µs min=6.7µs   max=48.69ms  p(90)=24.7µs   p(95)=33.2µs   p(99)=73.6µs  
    http_req_tls_handshaking...: avg=0s      min=0s      max=0s       p(90)=0s       p(95)=0s       p(99)=0s      
    http_req_waiting...........: avg=49.27ms min=969.5µs max=350.64ms p(90)=144.82ms p(95)=180.06ms p(99)=259.84ms
    http_reqs..................: 165546  2759.007311/s
    iteration_duration.........: avg=1.04s   min=1s      max=1.35s    p(90)=1.13s    p(95)=1.17s    p(99)=1.26s   
    iterations.................: 162651  2710.758932/s
    vus........................: 3000    min=593  max=3000
    vus_max....................: 3000    min=3000 max=3000